<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"65d3003017cb6767850e10d7df6157ed6d1062db99a62a692819d2edde50cd5c","plan_job_ref":"Job Terraform Plan #450 at https://github.com/cal-itp/data-infra/actions/runs/17140601357","plan_out_hash":"4f848fb96c9fe0a85b83ea2cdc5e3f4802697575a1a8f8e54415f24d0f1d7788","plan_hash":"a6136cfdcabd12b13c3ccecc3353682febc97a9a5ea8ee51e278eccab63818ea","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_service_account.sftp-pod-service-account will be created
+   resource "google_service_account" "sftp-pod-service-account" {
+       account_id   = "************************"
+       description  = "Service account for sftp server"
+       disabled     = false
+       display_name = "sftp-pod"
+       email        = "sftp-pod-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       id           = (known after apply)
+       member       = "serviceAccount:sftp-pod-service-account@cal-itp-data-infra.iam.gserviceaccount.com"
+       name         = (known after apply)
+       project      = "cal-itp-data-infra"
+       unique_id    = (known after apply)
    }

  # google_service_account_iam_member.enghouse-raw-sftp-service-account will be created
+   resource "google_service_account_iam_member" "enghouse-raw-sftp-service-account" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "serviceAccount:cal-itp-data-infra.svc.id.goog[default/sftp-pod-service-account]"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #450](https://github.com/cal-itp/data-infra/actions/runs/17140601357)